import matplotlib
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import datetime as datetime


# Вывод массива данных из локального файла '.xlsx'
df = pd.read_excel(r"D:\Данные\МУИВ\2 курс\Практика1\Python\Самокаты.xlsx", engine='openpyxl')
df['Среднее количество'] = df[['Москва','Ногинск','Зеленоград','Щёлково', #Среднее
                                     'Химки','Подольск','Монино','Люберцы','Реутов',
                                     'Королёв','Сергиев-Пасад','Троицк','Серпухов',
                                     'Красногорск','Мытищи']].mean(axis=1)
df['Всего самокатов'] = df[['Москва','Ногинск','Зеленоград','Щёлково', #Сумма
                  'Химки','Подольск','Монино','Люберцы','Реутов',
                  'Королёв','Сергиев-Пасад','Троицк','Серпухов',
                  'Красногорск','Мытищи']].sum(axis=1)
sort = df[(df['Москва'] >0)] # Сносим нули



sort.to_excel('Result.xlsx')
df.to_excel('all_months.xlsx')
print(sort)








#sort['Среднее значение дня'] = sort[['Москва','Ногинск','Зеленоград','Щёлково','Химки','Подольск',
#             'Монино','Люберцы','Реутов','Королёв','Сергиев-Пасад','Троицк',
#              'Серпухов','Красногорск','Мытищи']].mean(axis=1)
#sum_col = ['Москва','Ногинск','Зеленоград','Щёлково','Химки','Подольск',
#              'Монино','Люберцы','Реутов','Королёв','Сергиев-Пасад','Троицк',
#              'Серпухов','Красногорск','Мытищи']
#sort['Сумма'] = sort[sum_col].sum(axis=1)


#writer = pd.ExcelWriter('MyData.xlsx',
#                        date_format = 'yyyy mm dd',
#                        datetime_format='yyyy mm dd')


